<HTML>
<HEAD>
<TITLE>Hilfe

</TITLE>
<STYLE type="text/scc">

 P.page {page-break-after: always}

</STYLE>
</HEAD>
<BODY BGCOLOR="silver" topmargin=1 leftmargin=1>
<FONT FACE="Arial" SIZE="2" COLOR="black"><A NAME="start"></A>
<TABLE BORDER=0 BGCOLOR=MIDNIGHTBLUE WIDTH=100%>
<TR><TH NOWRAP ALIGN=LEFT><FONT SIZE=2 COLOR=WHITE>
<A NAME="start">Hilfe</A>
</FONT></TH>
</TR></TABLE>
<HR>

<TABLE BORDER=0 NOWRAP><TR><TD NOWRAP><FORM><a href="blank1.htm">
<IMG SRC="hback.gif" ALT="Zur&uuml;ck" border=0></a></FORM>
</TD></TR></TABLE>

<TABLE BORDER=1><TR><TD>
<TABLE BORDER=0>
<TR><TD>
<B><FONT FACE="Arial" SIZE=4>Wie k&ouml;nnen &Uuml;bersetzungen am effektivsten vorgenommen und mehrsprachige Anwendungen programmiert werden?</P><P>&nbsp;</P>
</B></FONT><FONT FACE="Arial" SIZE=2>
Beim Anlegen von Objekten, Formularfeldern, Formulareinzelfeldern, Hilfetexten, Listen, &Uuml;berschriften etc. befindet sich in @net Manager rechts oben ein Button mit dem Symbol f&uuml;r "Sprachen". Klickt man diesen Button an, f&uuml;hrt @net in eine Erfassungsmaske, in der zun&auml;chst die gew&uuml;nschte Sprache ausgew&auml;hlt werden und dann der Begriff in der jeweiligen Sprache erfa&szlig;t werden kann. So erlaubt @net Manager, da&szlig; direkt beim Anlegen von Feldern etc. die &Uuml;bersetzung dazu mit erfa&szlig;t wird. F&uuml;r &Uuml;bersetzungen in manuellen Routinen erm&ouml;glicht @net Manager zun&auml;chst im Men&uuml;punkt "Sprachentexte" die Erfassung von Textnummern und den zugeordneten W&ouml;rtern/Texten. In den Routinen werden dann die Textnummern eingef&uuml;gt. Beispiel: W $$^WWWTEXT(1000). @net Manager erlaubt dar&uuml;berhinaus die nachtr&auml;gliche &Uuml;bersetzung der angelegten Objekte, Formularfelder, &Uuml;berschriften usw.: Im Men&uuml;punkt "Dienstprogramme", "&Uuml;bersetzungen erfassen" k&ouml;nnen die gew&uuml;nschten Sprachen angeklickt werden. @net Manager sucht dann alle noch nicht &uuml;bersetzten W&ouml;rter und listet diese auf. Die &Uuml;bersetzung kann dann in das darunterstehende Feld eingegeben werden. Sofern @net Manger den zu &uuml;bersetzenden Begriff bereits im umfassenden W&ouml;rterbuch gespreichert hat, wird die neue &Uuml;bersetzung vorgeschlagen und braucht lediglich best&auml;tigt - oder ge&auml;ndert - zu werden.
</FONT>
</B></FONT>

<P>&nbsp;</P>




</FONT>

</TD></TR></TABLE>
<A HREF="#start"> <IMG SRC="up.gif" alt="Seitenanfang" border=0></A>
<BR>
</BODY>

</HTML>


