<HTML>
<HEAD>
<TITLE>Hilfe

</TITLE>
<STYLE type="text/scc">

 P.page {page-break-after: always}

</STYLE>
</HEAD>
<BODY BGCOLOR="silver" topmargin=1 leftmargin=1>
<FONT FACE="Arial" SIZE="2" COLOR="black"><A NAME="start"></A>
<TABLE BORDER=0 BGCOLOR=MIDNIGHTBLUE WIDTH=100%>
<TR><TH NOWRAP ALIGN=LEFT><FONT SIZE=2 COLOR=WHITE>
<A NAME="start">Hilfe</A>
</FONT></TH>
</TR></TABLE>
<HR>

<TABLE BORDER=0 NOWRAP><TR><TD NOWRAP><FORM><a href="blank1.htm">
<IMG SRC="hback.gif" ALT="Zur&uuml;ck" border=0></a></FORM>
</TD></TR></TABLE>

<TABLE BORDER=1><TR><TD>
<TABLE BORDER=0>
<TR><TD>

<B><FONT FACE="Arial" SIZE=4>
<P>&nbsp;</P>
<P>Was ist @net Manager?</P>
</B></FONT><FONT FACE="Arial">
</FONT><FONT FACE="Arial" SIZE=2><P>@net Manager ist eine Cach&eacute; Client Server Anwendung, mit der sowohl einfache als auch komplexe, datenreiche, objektorientierte, dynamische, multilinguale und multikulturelle Internet- und Intranet-Client Server Anwendungen online erzeugt werden k&ouml;nnen.</P>

<P>Mit @net Manager ist Applicationsentwicklung so einfach wie Surfen im Internet! Der Browser wird als Programmierer- und Anwender Front End genutzt. Das bedeutet, die Progammierer k&ouml;nnen irgendwo auf dieser Welt online Applicationen erstellen, die wiederum weltweit sofort und online lauff&auml;hig sind. </P>

<B><P>Wie macht @net Manager das?</P>
</B>
<P>@net Manager erzeugt mit Hilfe von Cach&eacute; in Verbindung mit Weblink dynamische HTML or XML Seiten. Aus einem Event der Seite (i.e. Button: Speichern, Neu, L&ouml;schen, &Ouml;ffnen, n&auml;chster Datensatz, Verzweigungen in andere Programme/Formulare/Links) wird der gesamte Programmablauf gesteuert.</P>
<P>Durch das Man&ouml;vern durch die einzelnen Seiten werden durch die Auswahl von Methoden, das Bestimmen gew&uuml;nschter Funktionen und den Eintrag von Eigenschaften letztlich die Anwendungen erzeugt. Dabei werden keine fertigen HTML Seiten compiliert, sondern erst zur Laufzeit werden alle Objekte ausgewertet und aufgrund der Benutzer- und Modulinformation (Berechtigung, Sprache, Kultur, Farben, Formen) neue dynamische Seiten erzeugt. </P>
<P> </P>
<B><P>Wie sind @net Manager und die @net Manager Anwendungen aufgebaut?</P>
</B>
<P>@net Manager bedient sich des Objekt Modells. F&uuml;r @net Manager ist damit jede HTML Seite ein Objekt. Dieses Objekt hat viele unterschiedliche Eigenschaften, Methoden und wiederum Objekte. Es gibt einfache Eigenschaften wie Farben, Formen, Frames oder Buttons, aber auch komplexere wie Cach&eacute; Datenbank Objekte.  Wenn eine Anwendung sich auf eine Datenbank bezieht oder eine neue Datenbank angelegt werden soll (diese kann nat&uuml;rlich sp&auml;ter auch als Cach&eacute;ObjectScript ausgegeben werden) kann @net Manager automatisch die Eigenschaften auf die Anwendung vererben. Das gleiche geschieht z.B. bei Layoutvorgaben, die von Mandant <FONT FACE="Wingdings">&#224;</FONT>
 auf die Anwendung <FONT FACE="Wingdings">&#224;</FONT>
 auf das Formular <FONT FACE="Wingdings">&#224;</FONT>
 auf das Datenfeld vererbt werden k&ouml;nnen.</P>

<B><P>Wie ist die grobe Objektstruktur einer HTML Anwendung von @net Manager?</P>
</B>
<P>Hier ein &Uuml;berblick &uuml;ber einige @net Manager Objecte:</P>

<P><FONT FACE="Wingdings">&#224;</FONT>
<B>Benutzer-Objekt</P>
</B><P>&#9;<FONT FACE="Wingdings">&#224;</FONT>
Allgemeine Eigenschaften (Name/Password/Infos)</P>
<P>&#9;<FONT FACE="Wingdings">&#224;</FONT>
Spracheigenschaften</P>
<P><FONT FACE="Wingdings">&#224;</FONT>
Kultureigenschaften</P>
<P><FONT FACE="Wingdings">&#224;</FONT>
Layouteigenschaften</P>
<P>&#9;<FONT FACE="Wingdings">&#224;</FONT>
Zugangsberechtigungseigenschaften</P>
<P>&#9;<FONT FACE="Wingdings">&#224;</FONT>
Firmenzugeh&ouml;rigkeiten</P>
<P>&#9;<FONT FACE="Wingdings">&#224;</FONT>
Modul-Eigenschaften</P>
<P>&#9;<FONT FACE="Wingdings">&#224;</FONT>
Verbindungseigenschaften (e-mail-Konto/IP-Nr./Server)</P>
<B>
</B><P><FONT FACE="Wingdings">&#224;</FONT>
<B>Menue-Objekt</P>
</B><P>&#9;<FONT FACE="Wingdings">&#224;</FONT>
Starteigenschaften (Formular/Liste/URL/.EXE/...)</P>
<P>&#9;<FONT FACE="Wingdings">&#224;</FONT>
Spracheigenschaften</P>
<P>&#9;<FONT FACE="Wingdings">&#224;</FONT>
Layouteigenschaften</P>
<P>&#9;<FONT FACE="Wingdings">&#224;</FONT>
Moduleigenschaften</P>
<P>&#9;<FONT FACE="Wingdings">&#224;</FONT>
Zugangsberechtigungseigenschaften</P>

<B><P><FONT FACE="Wingdings">&#224;</FONT>
Formular-Objekt</P>
</B><U><P><FONT FACE="Wingdings">&#224;</FONT>
Layouteigenschaften</P><DIR>
<DIR>

</U><P><FONT FACE="Wingdings">&#224;</FONT>
Frame-Eigenschaften (Target-Namen)</P></DIR>
</DIR>

<P>&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Farben  (Hindergrundfarben Bilder,Hintergrund-Musik...)</P>
<P>&#9;<FONT FACE="Wingdings">&#224;</FONT>
Seitenreitereigenschaften (Farben, Text, Formen, Bilder)</P>
<P>&#9;<FONT FACE="Wingdings">&#224;</FONT>
allgemeines Layout (vererbt aus der Mandanteneigenschaften)</P>
<P>&#9;<FONT FACE="Wingdings">&#224;</FONT>
<U>Formular-Artenmethoden</P>
</U><P>&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Men&uuml;methode</P>
<P>&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Standardformularmethode (Einzelfelder)</P>
<P>&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Gridformularmethode (Tabellen-Form)</P>
<P>&#9;<FONT FACE="Wingdings">&#224;</FONT>
Listenerstellungmethode</P>
<P>&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Manuelle Formularmethode&#9;</P>
<U><P><FONT FACE="Wingdings">&#224;</FONT>
Eigenschaften f&uuml;r embeded Objects</P>
</U><P>&#9;<FONT FACE="Wingdings">&#224;</FONT>
<U>Moduleigenschaften</P>
<P><FONT FACE="Wingdings">&#224;</FONT>
Zugangsberechtigungseigenschaften</P>
<P><FONT FACE="Wingdings">&#224;</FONT>
Daten&auml;nderungseigenschaften</U>&#9;&#9;&#9;</P>
<U><P><FONT FACE="Wingdings">&#224;</FONT>
Systemparameter</P>
<P><FONT FACE="Wingdings">&#224;</FONT>
Datenbankeigenschaften</P>
</U><P>&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Prim&auml;rschl&uuml;sseleigenschaften</P><DIR>
<DIR>
<DIR>
<DIR>

<P><FONT FACE="Wingdings">&#224;</FONT>
Layouteigenschaften</P></DIR>
</DIR>
</DIR>
</DIR>

<P>&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Feldeigenschaften (Namen/Feldl&auml;ngen/Arten/...)</P>
<P>&#9;&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Relationseigenschaften</P>
<P>&#9;&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Indexeigenschaften</P>
<P>&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Spracheigenschaften</P>
<P>&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Kultureigenschaften</P>
<P>&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Datenfeldeigenschaften</P>
<P>&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Layouteigenschaften</P><DIR>
<DIR>
<DIR>
<DIR>
<DIR>
<DIR>

<P><FONT FACE="Wingdings">&#224;</FONT>
Erfassungsmethoden (Datum, Text, Document, Password, W&auml;hrung, Zahlen, Dateien, Checkboxen,...)</P></DIR>
</DIR>
</DIR>
</DIR>
</DIR>
</DIR>

<P>&#9;&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Relationseigenschaften</P>
<P>&#9;&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Indexeigenschaften</P>
<P>&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Spracheigenschaften</P>
<P>&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Kultureigenschaften</P>
<P>&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Speicherungsmethoden und Eigenschaften  </P>
<P>&#9;<FONT FACE="Wingdings">&#224;</FONT>
Spracheneigenschaften</P>
<P>&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Lockeigenschaften</P>
<P>&#9;<FONT FACE="Wingdings">&#224;</FONT>
Berechtigungseigenschaften</P>
<P>&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Indexeigenschaften und Methoden</P>
<P>&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Datenfeldeigenschaften</P><DIR>
<DIR>
<DIR>
<DIR>
<DIR>
<DIR>

<P><FONT FACE="Wingdings">&#224;</FONT>
Erfassungsmethoden (Datum, Text, Document, Password, W&auml;hrung, Zahlen, Dateien, Checkboxen,...)</P></DIR>
</DIR>

<P><FONT FACE="Wingdings">&#224;</FONT>
Relationseigenschaften</P></DIR>
</DIR>
</DIR>
</DIR>

<P>&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Indexeigenschaften&#9;&#9;</P>
<U><P><FONT FACE="Wingdings">&#224;</FONT>
Formularfeldeigenschaften</P><DIR>
<DIR>

</U><P><FONT FACE="Wingdings">&#224;</FONT>
Layouteigenschaften</P></DIR>
</DIR>

<P>&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Feldvalidierungsmethoden</P>
<P>&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Cach&eacute; Routinen (Eingabefeld Pr&uuml;fungen)</P>
<P>&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
JavaScript (Eingabefeld Pr&uuml;fungen)</P>
<P>&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
VBScript (Eingabefeld Pr&uuml;fungen)</P>
<P>&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Eingabevorgaben</P>
<P>&#9;&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Userbezogen</P>
<P>&#9;&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Anwendungsbezogen</P>
<P>&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Felderfassungsmethoden (Selection, Multi-Selection, Radiobutton)</P>
<U><P><FONT FACE="Wingdings">&#224;</FONT>
Standard-Buttoneigenschaften</U>(save, open, new, delete, help, next...) </P>
<P>&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Speicherungseigenschaften</P><DIR>
<DIR>
<DIR>
<DIR>

<P><FONT FACE="Wingdings">&#224;</FONT>
JavaScript</P></DIR>
</DIR>
</DIR>
</DIR>

<P>&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
VBScript</P>
<P>&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Unterformularaufrufmethoden</P>
<P>&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Frontpage (url)</P>
<P>&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Externe Eigenschaften (.exe)</P>
<P>&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Lese-Eigenschaften</P>
<P>&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
L&ouml;scheigenschaften</P>
<P>&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Hilfeeigenschaften</P>
<P>&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Sprachenabh&auml;ngige Hilfe</P><DIR>
<DIR>

<P><FONT FACE="Wingdings">&#224;</FONT>
Such-Buttoneigenschaften</P></DIR>
</DIR>

<P>&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Such- und Selections- Methoden</P>
<P>&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Anzeigeeigenschaften</P>
<P>&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Suchergebnis-&Uuml;bertragungseigenschaften</P>
<P>&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Summenbildungseigenschaften</P>
<U><P><FONT FACE="Wingdings">&#224;</FONT>
Buttoneigenschaften </U>(manuelle Button)</P>
<P>&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Spracheneigenschaften</P>
<P>&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Verteilungsmethoden</P>
<P>&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
JavaScript</P>
<P>&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
VBScript</P>
<P>&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Unterformularaufrufmethoden</P>
<P>&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Frontpage (url)</P>
<P>&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Externe Eigenschaften (.exe)</P>
<P>&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Buttonlayouteigenschaften&#9;</P>
<U><P><FONT FACE="Wingdings">&#224;</FONT>
Firmeneingeschaften</P>
</U><P>&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Module</P>
<P>&#9;<FONT FACE="Wingdings">&#224;</FONT>
<U>Listgenaratoreigenschaften</P>
</U><P>&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Seitenlayouteigenschaften</P>
<P>&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
List-Formateigenschaften (&lt;pre&gt;formated,&lt;Table&gt; or XML)</P>
<P>&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Link-Optionen</P>
<P>&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Datenbankeingenschaften</P>
<P>&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Prim&auml;rschl&uuml;sseleigenschaften</P>
<P>&#9;&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Feld-Selektionseigenschaften (Einzel/von-bis/Kombi)</P>
<P>&#9;&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Feld-Layouteigenschaften</P>
<P>&#9;&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Relationseigenschaften</P>
<P>&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Datenfeldeigenschaften</P>
<P>&#9;&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Feld-Selektionseigenschaften</P>
<P>&#9;&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Feld-Layouteigenschaften</P>
<P>&#9;&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Relationseigenschaften</P>
<P>&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
Pr&uuml;fungseigenschaften</P><DIR>
<DIR>
<DIR>
<DIR>

<P><FONT FACE="Wingdings">&#224;</FONT>
Cach&eacute; Routinen </P></DIR>
</DIR>
</DIR>
</DIR>

<P>&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
JavaScript </P>
<P>&#9;&#9;&#9;<FONT FACE="Wingdings">&#224;</FONT>
VBScript </P>

<P>&nbsp;</P>
<P>&nbsp;</P>
<P>Internet und Intranet werden heute von vielen Firmen und privaten Anwendern genutzt. Man hat erkannt, da&szlig; die Internet-Technik f&uuml;r eine Online-Verbindung preiswerter ist als die meisten herk&ouml;mmlichen Netze. Da es sich beim Internet um ein weltweites Netz handelt, nimmt die Bedeutung von internationalen Anwendungen immer mehr zu. So profitieren z.B. gro&szlig;e Softwareh&auml;user, die in unterschiedlichen L&auml;ndern oder auf mehreren Kontinenten Filialen haben, von Anwendungen, die mehrsprachig sind und von vielen Mitarbeitern f&uuml;r diverse Zwecke eingesetzt werden k&ouml;nnen. Betrachtet man allein die derzeitige Entwicklung auf dem europ&auml;ischen Markt, wird deutlich, welche Vorteile eine mehrsprachige und multikulturelle Online-Anwendung hat. Die Anwender der verschiedenen Staaten brauchen sich nicht auf eine einheitliche Sprache zu einigen, sondern jeder kann sein Programm in seiner Landessprache nutzen. Auch die kulturell typische Schreibweise von W&auml;hrungen, dem Datum und der Uhrzeit erleichtern die Einarbeitung von Usern erheblich.</P>

<P>@net Manager erm&ouml;glicht eine preiswerte Verteilung von Ressourcen. So kann z.B. der Server in Kanada stehen, die Entwicklungsabteilung in den USA ans&auml;ssig sein, die Datenerfassung in Indien erfolgen und die statistische Auswertung von einer Firma in Deutschland abgerufen werden - alles online, mehrsprachig und multikulturell! Ben&ouml;tigt die Abteilung Statistik z.B. ein neues Datenfeld, gen&uuml;gt ein E-Mail in die USA. Dort wird das neue Datenfeld mit Hilfe von @net Manager auf einfache Art und Weise innerhalb von wenigen Minuten generiert. Nach dem Aufrufen der HTML Seite in Indien durch die Datenerfasser ist das neue Feld in Indien aktiviert. Durch die von @net Manager automatisch beim Entwickeln zu Verf&uuml;gung gestellten Hilfefunktionen wird es allen Usern leicht gemacht, die Neuerungen unverz&uuml;glich zu nutzen.</P>

<P>Auch die Intranet Programmierung von Systemh&auml;usern f&uuml;r Dritte wird mit @net Manager vereinfacht. Neben den unterst&uuml;tzenden Funktionen bei der Entwicklung gibt es einfache Prozeduren zur Auslagerung von Programmst&auml;nden oder Modulen auf beliebige Medien. So lassen sich komplexe Anwendungen mit Hilfe von @net Manager erstellen und einfach supporten.</P>

<P>Die Arbeit mit @net Manager ist zeitsparend, der Einstieg einfach. Durch eine &uuml;bersichtliche Men&uuml;f&uuml;hrung und eine detaillierte Online-Hilfe findet man sich gut zurecht. So kann @net Manager von privaten Anwendern ohne Programmierkenntnisse genauso genutzt werden wie von kleinen, mittleren oder gro&szlig;en internationalen Softwareh&auml;usern mit hohen Anspr&uuml;chen. </P>

<P>Wer die Browser-Technik nutzt, verwendet oft auch andere Produkte, die HTML/XML (XML in Vorbereitung) verstehen, wie z.B. Microsoft Word, Excel etc. Die Inhalte einer mit @net Manager generierten Liste lassen sich einfach in anderen Programmen (z.B. Excel) weiterbearbeiten. Die @net Manager Men&uuml;punkte k&ouml;nnen nicht nur auf @net Manager Anwendungen linken, sondern auch auf andere Anwendungen (.EXE), andere URLs oder eine mit FrontPage erstellte lokale statische HTML Seite.</P>

<P>Mehr und mehr Firmen bieten ihre Produkte in Internet-Shops zum Verkauf an. Hier findet sich auch ein Einsatzgebiet von @net Manager. Wenn mit FrontPage o.&auml;. ein Internet-Shop erstellt wurde, kann mit @net Manager die Administration dazu kreiert werden. Das bedeutet, mit @net Manager l&auml;&szlig;t sich die gesamte Auftragsverwaltung des Shops gestalten (Bestellung, Auftragsbest&auml;tigung, Lieferschein, Fakturierung, Lagerbestandsverwaltung, Lagersteuerung etc.).</P>

<B><P>Weitere Vorteile von @net Manager:</P>
</B>
<B><P>Objektorientiert:</B> Die ben&ouml;tigte Funktionalit&auml;t konnte nur mit einem Objekt Modell gel&ouml;st werden. Auch f&uuml;r die Vererbung von Layout-Eigenschaften war diese Vorgehensweise ideal. Ein weiterer Vorteil der Objektorientiertheit ist die Ausgabe in Form von Cach&eacute;OjectScripts, damit Daten und Datensatzdefinitionen in bestehenden Cach&eacute; Anwendungen weiterverwendet werden k&ouml;nnen. </P>
<I><U>
</I></U><B><P>Mehrsprachig:</B> Das gesamte Tool ist, wie auch die erstellten Anwendungen, mehrsprachig. &Uuml;bersetzungen k&ouml;nnen manuell oder automatisch erfasst werden. Ein &Uuml;bersetzungs-Tool sucht in der entstandenen Anwendung nach unvollst&auml;ndigen &Uuml;bersetzungen und schl&auml;gt aus einer Cach&eacute; Datenbank eine m&ouml;gliche &Uuml;bersetzung vor, die ge&auml;ndert und gespeichert werden kann. Der &Uuml;bersetzungsproze&szlig; schlie&szlig;t sogar Maskenk&ouml;pfe, Datenbank-Name, Menues, Hilfetexte, Statustexte, Parameter, Seiten-Reiter und Button-Bezeichnungen ein. Alle sprachabh&auml;ngigen Objekte haben eine Spracheigenschaft, die aktiv wird, sobald @net Manager die Sprache des Benutzers kennt. </P>
<I><U>
</I></U><B><P>Multi-Kulturell: </B> Wie bei der Sprachkennung haben Felder (wie z.B. Datum, Uhrzeit, Betragsfelder) eine Kultureigenschaft, die aktiv wird, sobald @net Manager die Kultur des Benutzers kennt. Die Zahl "Eintausend" z.B. k&ouml;nnte wie folgt aussehen: englisch "1,000.00"; deutsch "1.000,00"; schweizerisch "1'000,00"; portugiesisch "1,000$00" usw. Auch Daten (amerikanisch "02/04/1999" oder deutsch "02.04.1999") und Uhrzeiten (englisch "5 pm" oder deutsch "17:00") werden je nach Kultur des Anwenders dargestellt.</P>
<I><U>
</I></U><B><P>Multidimensional:</B> @net Manager erm&ouml;glicht komplexe Anwendungen und Programmverteilungsmethoden zu anderen Formularen, die Multidimensional miteinander verbunden sind, aber auch zu URL´s oder .EXE Anwendungen (i.e. Word, Fax, e-mail).</P>
<I><U>
</I></U><B><P>Dynamisch:</B> Alle Teile der Anwendung (Men&uuml;s, Masken, Listen, sogar das Tool selbst) werden erst bei der Laufzeit von einem Cach&eacute; Programm mit den erfa&szlig;ten Maskendefinitionen, Layout-Parametern, Datensatzdefinitionen, Datenfelddefinitionen, Button-Beschreibungen, Such-Parametern, der Benutzer-Sprache, der Benutzer-Zugriffs-Berechtigung, dem JavaScript/VBScript, den Object-Sammlungen (save, open, delete, new, next record, prior record...), usw zusammengestellt. Das Ergebnis ist ein dynamisches HTML Dokument mit eingebundenem JavaScript/VBScript. Die Feldpr&uuml;fungen werden sowohl von JavaScript/VBScript als auch von Cach&eacute; Routinen vorgenommen.</P>
<I><U>
</I></U><B><P>Besonders benutzerfreundlich:</B>. Alle Anwendungen, die mit @net Manager entwickelt werden, sind anwenderfreundlich, denn alle Eingabefelder sind darauf vorbereitet, einen Hilfetext zu tragen. In jeden Hilfetext k&ouml;nnen Bilder oder Videos eingebunden werden. Der Anwender kann sich je nach Wunsch eine gesamte Bedienungsanleitung ausdrucken oder sich die einzelnen Hilfetexte durch Klicken des Hilfebuttons auf dem Bildschirm ansehen. Auch f&uuml;r Programmierer stellt @net Manager eine Vielzahl von Hilfetexten und Hilfsfunktionen bereit. @net Manager kreiert z.B. automatisch Formulare und Listen aus der Datensatzdefinition und schl&auml;gt Eingabearten (Checkboxen, Radio buttons, Selektionsfelder ) vor, wenn auf Relationen verwiesen wird. Au&szlig;erdem erkennt @net Manager bestimmte Eingabemuster (z.B. e-mail Adressen) und kreiert automatisch einen Button, der dann die entsprechende Funktion ausf&uuml;hrt. Bestandteil von @net Manager sind dar&uuml;berhinaus eine Reihe von kompletten Anwendungen und Hilfsprogrammen (z.B. automatisches e-mail und Fax System, Download, embeded object, Gruppenterminkalender, Datenimport- und -export-Tools, Schwarzes Brett etc.).</P>
<I><U>
<P>&nbsp;</P>
</I></U><B><P>Multi-Userf&auml;hig</B>: Da viele Anwender gleichzeitig online auf die Datenbank zugreifen k&ouml;nnen, aber der Programmjob nach dem Senden der Seite beendet ist, war ein neuer Satzlockmechanismus f&uuml;r diese Art von Internet-Programmierung n&ouml;tig, da der bestehende Lock-Mechanismus (+L und -L) nicht verwendet werden konnte. Der neue Mechanismus ist je Datei einstellbar, individuell und zeitlich begrenzt. Nur der Besitzer des Datensatzes kann den Datensatz &auml;ndern. Das bedeutet, sobald man einen Datensatz angezeigt bekommt, ist dieser gelockt. Wenn die vorgegebene Lockzeit abgelaufen ist, kann ein neuer Benutzer an den Datensatz. Derjeige, der urspr&uuml;nglich gelockt hat, kann einfach wegklicken und der Datensatz wird wieder entlockt (unlocked), obwohl die Bearbeitung via Browser ja offline ist.</P>
<I><U>
</I></U><B><P>Mandantenf&auml;higkeit:</B> Ein Server verweist mit WebLink auf einen bestimmten Benutzerbereich (Namespace) und startet entsprechende Routinen. Innerhalb der @net Manager Anwendung k&ouml;nnen beliebig viele unabh&auml;ngige Firmen angelegt werden. Je Anwender kann hinterlegt werden in welcher Firma er arbeitet. So erlaubt @net Manager einer unlimitierten Zahl von Firmen und Nutzern, gleichzeitig und ohne St&ouml;rung innerhalb nur eines Namespace auf die Firmen Datenbanken zuzugreifen.</P>
<I><U>
</I></U><B><P>Sicherheit:</B> Bei der erfolgreichen Anmeldung eines Benutzers mit Benutzername und Password wird von @net Manager eine einmalige User-Nummer vergeben, die im weiteren Verlauf der Sitzung automatisch in die dynamischen Seiten eingebunden ist und damit in Verbindung als Berechtigung gilt. Nach Beendigung der Sitzung ist diese User-Nummer nicht mehr g&uuml;ltig. Ein anderer User kann dann nicht einfach mit dem Button "Zur&uuml;ck" oder der rechten Maustaste an die Informationen herankommen.</P>
</FONT>

</FONT>

</TD></TR></TABLE>
<A HREF="#start"> <IMG SRC="up.gif" alt="Seitenanfang" border=0></A>
<BR>
</BODY>

</HTML>


