<HTML>
<HEAD>
<TITLE>Hilfe

</TITLE>
<STYLE type="text/scc">

 P.page {page-break-after: always}

</STYLE>
</HEAD>
<BODY BGCOLOR="silver" topmargin=1 leftmargin=1>
<FONT FACE="Arial" SIZE="2" COLOR="black"><A NAME="start"></A>
<TABLE BORDER=0 BGCOLOR=MIDNIGHTBLUE WIDTH=100%>
<TR><TH NOWRAP ALIGN=LEFT><FONT SIZE=2 COLOR=WHITE>
<A NAME="start">Hilfe</A>
</FONT></TH>
</TR></TABLE>
<HR>

<TABLE BORDER=0 NOWRAP><TR><TD NOWRAP><FORM><a href="blank1.htm">
<IMG SRC="hback.gif" ALT="Zur&uuml;ck" border=0></a></FORM>
</TD></TR></TABLE>

<TABLE BORDER=1><TR><TD>
<TABLE BORDER=0>
<TR><TD>

<B><FONT FACE="Arial" SIZE=4><P>Wie generiert man Formulare?</P>
</B></FONT><FONT FACE="Arial" SIZE=2><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">@net Manager kann Formulare automatisch aus den Datensatzdefinitionen erstellen. Beispiel f&uuml;r ein automatisch erstelltes Formular: Men&uuml;punkt "Lager" - Untermen&uuml; "Lagerstammdaten" - darunter "Erfassen Lagerparameter". Zur automatischen Erstellung gibt man bei "Erstellen von Formularen und Listen" die Formularart "Standardformular" ein. Die "Basisdatei f&uuml;r Formular" ist die Lagerdatei, die in der Datensatzdefinition hinterlegt ist. Werden dann noch die Punkte "Autom. Formular generieren" und "Vorgabe aus Mandantenvorgabe" ausgew&auml;hlt, erstellt @net Manager automatisch ein vollst&auml;ndiges Formular. Das Fomular generiert sich erstmalig durch Aufrufen des Buttons "Testen von Formularen". Anschlie&szlig;end sind die Datenfelder automatisch verf&uuml;gbar, die nat&uuml;rlich noch manuell erg&auml;nzt werden k&ouml;nnen.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Am Beispiel des Datenfeldes "Lagerbild"  wird klar, wie man Feldpr&uuml;fungen &auml;ndern kann. @net Manager setzt das Feld Erfassungsart auf Automatik. Soll dies &uuml;berschrieben werden mit der Erfassungsart "File", wodurch automatisch der Button "Durchsuchen..." erscheint, w&auml;hlt man im Feld Erfassungsart die Option "File". </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Das Programm "Erfassen Lagerparameter" ist au&szlig;erdem ein Beispiel daf&uuml;r, was das Feld "Option" bedeutet. Wird z.B. die Option "mit Lagerbild" ausgew&auml;hlt, generiert @net Manager beim Aufrufen des Formulars automatisch ein Foto des Lagers. Wenn optional "ohne Lagerbild" gew&uuml;nscht, erscheint das Bild des Lagers nicht.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Wie in @net Manager JavaScript-Anwendungen eingef&uuml;gt werden k&ouml;nnen, wird ebenfalls im Programm "Erfassen Lagerparameter" deutlich (siehe Feld "Anzahl Wageng&ouml;&szlig;en"). </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Weitere Beispiele und Erl&auml;uterungen zum Erstellen von Formularen finden Sie in den entsprechenden Hilfetexten.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">@net Manager erm&ouml;glicht, in automatisch erstellten Formularen Individualroutinen aufzurufen. Im Men&uuml;punkt "Erfassen Formulare/Listen" kann in den Feldern "Execute nach Speichen Datensatz" und "Execute nach L&ouml;schen Datensatz" die Individualroutine hinterlegt werden, die beim Speichern bzw. L&ouml;schen gestartet werden soll (siehe Hilfetexte). In der Demo-Version finden Sie das Beispiel "Ein-, Aus- und Umlagern von Wagen". Basisdatei f&uuml;r Formular ist hier die Datei "QLXZ (Lagerbewegungsdatei)". Aufgerufen wird die Individualroutine "QLXZ" zur Pr&uuml;fung von freien Lagerpl&auml;tzen etc. </P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Formulare mit Buttons</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Das Formular "Ein-, Aus- und Umlagern von Wagen" ruft durch Klicken auf den Button "Lageranweisungen" ein anderes Formular (Zielformular) auf. Damit das funktioniert, mu&szlig; zun&auml;chst der Button "Lageranweisungen" erstellt werden. Er besteht aus einer Bilddatei (GIF-File), die in einem beliebigem Grafikprogramm erstellt werden kann. In "Erstellen von Formularen" wird der Button "Button" angeklickt, um die Datei des neu erstellten Buttons "Lageranweisungen" im Feld "Bilddatei f&uuml;r Button" und die Bezeichnung des Zielformulars einzutragen.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Formulare ohne Buttons</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Soll ein Formular ohne Button erstellt werden, ist keine Basisdatei f&uuml;r das Formular einzutragen (Bsp.: Formular "Lageranweisungen ONLINE"). Man kann entweder freie Felder eintragen (Button "Freie Felder" anklicken) oder direkt eine Individualroutine (M-Routine im Feld "Execute bei Formularstart") aufrufen.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Manuelle Formulare</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Wird ein manuelles Formular gew&uuml;nscht, mu&szlig; als Formular-Art "Freie Felder (mit Button)" ausgew&auml;hlt werden. Im Feld "Execute nach Speichern Datensatz" wird die Individualroutine eingetragen, die nach dem Ausw&auml;hlen des Buttons "o.k." aufgerufen werden soll. Dann werden die freien Felder angelegt. Das erfassen der manuellen Felder geschieht im gleichen Programm wie das anlegen und Ändern von Datenfeldern.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Ein Beispiel f&uuml;r ein manuelles Formular ist "Lager&uuml;bersicht". Nach der Auswahl des Buttons "Datenfelder" wird im "Erfassen Datenfelder" im Feld "Manueller Fragetext" eingegeben, welcher Fragetext sp&auml;ter im Programm erscheinen soll. Im Feld "Inhalt in Variable" ist die Variable einzutragen, die @net Manager sp&auml;ter an das Programm abgeben soll (hier z.B. "VORG(1)). Das Programm, in dem dann die Bearbeitung erfolgt, ist die Routine "QLXU". Ausserdem können Sie noch die Erfassungsart / Länge und Relationsdateien angegeben werden. Um ein einmaliges Auswahlfeld zu erhalten können Sie auch Erfassungsalternativen erfassen. (Button: Selektionen)</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Unterformulare</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">@net Manager erlaubt die Funktionalit&auml;t des Wechselns in ein Unterformular durch einfaches Anklicken eines entsprechenden Buttons. Das Formular "Lagerparameter" beispielsweise enth&auml;lt einen Button "Lagerpl&auml;tze", durch dessen Anklicken @net Manager in das entsprechende Unterformular wechselt. Ein weiterer Button f&uuml;hrt durch Anklicken in das Unterformular "Lager-Wagen". Durch Bet&auml;tigen des "Zur&uuml;ck-Buttons" f&uuml;hrt @net Manager den Benutzer jeweils wieder in das vorherige Formular zur&uuml;ck.</P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Sollen verschiedene Formulare auf diese Art miteinander verbunden werden, ruft man zun&auml;chst das erste Formular auf (Beispiel: Formular "Lagerparameter"). In dem aufgerufenen Formular wird der Button "Button" angeklickt. @net Manager &ouml;ffnet dann eine Button-Datei, in der im Feld "Button-Bezeichnung" der Name des gew&uuml;nschten Buttons und im Feld "Formular bei onClick" die Datei, die aufgerufen werden soll (Beispiel "QLXP"), eingetragen wird. Anschie&szlig;end ist die Bilddatei f&uuml;r den gew&uuml;nschten Button einzutragen (Beispiel: "platz.gif"). Wird keine Bilddatei eingetragen, setzt @net Manager als Button die oben eingegebene Button-Bezeichnung ein, kreiert also einen Text-Button (z.B. der Button "Lager"). </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Soll beim Aufrufen eines Unterfomulars der Prim&auml;rschl&uuml;ssel des Vor-Formulars automatisch gesetzt werden, so ist im Feld "Fix Prim&auml;rschl&uuml;ssel Vor-Datei" des Unterformulars die Nummer des Prim&auml;rschl&uuml;ssels einzutragen. Nach dem Eintragen des Prim&auml;rschl&uuml;ssels ist dieser beim Aufrufen des Unterformulars fest vorgegeben.</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Manuelle Programme (Formulare)</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Soll in einem Formular durch Anklicken eines Buttons eine manuelle M-Routine, ein anderes Pogramm (z.B. Word, Excel etc.) oder eine andere Internet-Seite aufgerufen werden, wird diese Verbindung wie folgt vorgenommen: </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">In dem gew&uuml;nschten Formular wird der Button "Button" angeklickt. @net Manager &ouml;ffnet dann eine Button-Datei, in der im Feld "Button-Bezeichnung" der Name des gew&uuml;nschten Buttons eingetragen wird. Zum Aufrufen einer M-Routine ist im Feld "Execute bei onClick" die Datei, die aufgerufen werden soll (Beispiel "D ^QLXU"), einzugeben. Soll beim Anklicken des Buttons in ein anderes Programm gewechselt werden (z.B. Excel), ist im Feld "Verkn&uuml;pfung mit" der entsprechende Pfad- und Dateiname einzugeben (z.B. "C:/TEST.DOC").  Zum Aufrufen einer Internet-Suchmaschine ist als "Verkn&uuml;pfung mit" z.B. "http://www.altavista.com" einzutragen.</P>
<P ALIGN="JUSTIFY"></P>
<P>Anschie&szlig;end ist die Bilddatei f&uuml;r den gew&uuml;nschten Button einzutragen (Beispiel: "platz.gif"). Wird keine Bilddatei eingetragen, setzt @net Manager als Button die oben eingegebene Button-Bezeichnung ein, kreiert also einen Text-Button (z.B. der Button "Lager").</P>
<P ALIGN="JUSTIFY"></P>
<B><P ALIGN="JUSTIFY">Wie werden in Formularen Individualprogramme aufgerufen?</P>
</B><P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Bei jedem Formular und jeder Liste, das/die mit @net Manager erfa&szlig;t wird ("Erfassen Formulare/Listen"), k&ouml;nnen an verschiedenen Stellen M-Routinen hinterlegt werden. Es gibt die M&ouml;glichkeit eines "Execute bei Formularstart", "Execute nach Speichern Datensatz", "Execute nach L&ouml;schen Datensatz" und "Execute nach &Auml;ndern Datensatz". Einzutragen ist in diesen Feldern lediglich z.B. "Do ^PROGRAMM). @net Manager ruft dann die entsprechende M-Routine auf. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">Sollen M-Routinen oder auch JavaScript-Anwendungen f&uuml;r ein einzelnes Feld hinterlegt werden, klickt man zun&auml;chst in das gew&uuml;nschte Feld (Beispiel: Formular QLX Lagerparameter, Feld "Datenfeld Nummer"). Anschlie&szlig;end klickt man zum Laden des Datensatzes auf den &Ouml;ffnen-Button. Jetzt kann man entweder auf den Button M-Routinen oder JavaScript klicken. W&auml;hlt man z.B. JavaScript, &ouml;ffnet sich ein Unterformular, in das JavaScript-Anweisungen f&uuml;r das entsprechende Feld eingetragen werden k&ouml;nnen. M-Routinen k&ouml;nnen auf konventionelle Weise oder im Unterformular "Erstellen M-Routinen" erstellt werden. </P>
<P ALIGN="JUSTIFY"></P>
<P ALIGN="JUSTIFY">N&auml;heres dazu ist in den Hilfetexten hinterlegt.</P>
<P ALIGN="JUSTIFY"></P>
</FONT><FONT FACE="Arial"><P>&nbsp;</P>
</FONT>

</FONT>

</TD></TR></TABLE>
<A HREF="#start"> <IMG SRC="up.gif" alt="Seitenanfang" border=0></A>
<BR>
</BODY>

</HTML>



